//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПечататьОтчет(Команда)
	//@skip-check undefined-variable
	//@skip-check module-unused-local-variable
	//@skip-check unknown-method-property
	Макет = Отчеты.ОтчетПоФизЛицам.ПолучитьМакет(Макет);
	//@skip-check module-unused-local-variable
	ТабДок =  Новый ТабличныйДокумент();
	//@skip-check module-unused-local-variable
	//@skip-check unknown-method-property
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	//@skip-check module-unused-local-variable
	//@skip-check unknown-method-property
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	ДанныеФизЛиц = ПолучитьДанныеФизЛиц();
	Для Каждого Данные Из ДанныеФизЛиц Цикл
		Ссылка = Данные.Регистратор;
		ФИО = Данные.ФИО;
		Должность = Данные.Должность;
		СтажРаботы = Данные.СтажРаботы;
		ПериодСтажировки = Данные.ПериодСтажировки;
		ТабДок.Вывести(ОбластьТело);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФизЛиц()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрПоФизЛицам.Регистратор,
		|	РегистрПоФизЛицам.ФИО,
		|	РегистрПоФизЛицам.Должность,
		|	РегистрПоФизЛицам.СтажРаботы,
		|	РегистрПоФизЛицам.ПериодСтажировки
		|ИЗ
		|	РегистрСведений.РегистрПоФизЛицам КАК РегистрПоФизЛицам";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции