Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрПоФизЛицам
	Движения.РегистрПоФизЛицам.Записывать = Истина;
	Движение = Движения.РегистрПоФизЛицам.Добавить();
	Движение.Период = Дата;
	Движение.ФИО = ПолноеФИО;
	Движение.Должность = Должность;
	Движение.СтажРаботы = СтажРаботы;
	Движение.ПериодСтажировки = Период;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

